
public class Main {

	static int[][] arr = 
	{
		  {1, 16}, {2, 21}, {2, 25}, {2, 22}, {23, 50}, {23, 47}, {24 ,1}, {25 ,10},
		  {35, 7}, {36 ,45}, {36 ,37}, {38 ,42}, {39, 41},{12 ,37}, {12 ,23}, {12, 3},
		  {12 ,20}, {14 ,25}, {41, 9}, {42 ,3}, {43, 5}, {43 ,22}, {29, 2}, {30, 48},
		  {31 ,15}, {32 ,17}, {6, 45}, {6, 1}, {5 ,35}, {5, 20}, {5, 28}, {5, 11}, {48,
		  4}, {48, 10}, {49, 32}, {7, 31}, {7, 4}, {5 ,33}, {6, 29}, {6, 12}, {6, 11},
		  {6 ,3}, {6 ,17}, {45, 27}, {47 ,34}, {48, 20}, {7 ,40}, {7 ,34}, {8 ,11}, {9,
		  19}, {11 ,30}, {11 ,4}, {11, 22}, {11, 25}, {20, 24}, {21, 23}, {21, 46},
		  {22, 47}, {23, 49}, {3, 39}, {3, 34}, {4 ,14}, {4 ,37}, {5 ,42}, {5, 8}, {15,
		  2}, {15, 50}, {15 ,4}, {15 ,37}, {16 ,13}, {17, 38}, {18 ,28}, {19, 8}, {26
		  ,15}, {26, 42}, {27 ,18}, {28 ,35}, {13 ,36}, {13 ,50}, {13, 34}, {13 ,22},
		  {29 ,34}, {29 ,38}, {29, 30}, {29 ,16}, {44, 33}, {44, 36}, {44 ,7}, {44, 3},
		  {44, 32}, {44 ,21}, {33, 9}, {33 ,21}, {33, 35}, {33 ,19}, {33 ,41}, {26
		  ,10}, {26, 44}, {26, 16}, {26, 39}, {26,17}
		 
	};

	static int[] arr2 = new int[1000];
	//교착상태의 원소가 되는 순서쌍의 순서를 저장
	static int cnt;
	//arr2 원소의 개수
	static int count=0;
	//교착상태와 교착상태를 구분하는 구분점
	public static void main(String[] args) {
		for(int i=0;i<arr2.length;i++) {
			arr2[i] = -1;
		}
		System.out.println("----교착상태 리스트----");
		for (int i = 0; i < arr.length; i++) {
			arr2[cnt] = i;
			count = cnt;
			if (arr[i][0] == arr[i][1]) {
				//입력된 값의 x좌표와 y좌표가 같을 경우
				count++;
				print();
			} else {
				recursive(i, arr[i][0]);
			}
			cnt++;

		}

	}

	public static void print() {
		for (int i = count-1; i <= cnt; i++) {
			System.out.print("{"+arr[arr2[i]][0] + ", " + arr[arr2[i]][1]+"} ");
		}

		System.out.println();
	}

	public static int recursive(int num, int first) {
		//순서쌍 리스트에서 교착상태를 판별
		int a;
		for (int j = 0; j < arr.length; j++) {

			if (arr[num][1] == arr[j][0]) {
				for(int i=0;i<cnt;i++) {
					if(j == arr2[i]) {
						//arr2를 0으로 초기화 한 경우 0번째 순서에 있는 순서쌍들은 중복으로 판단되기 때문에
						//arr2를 -1로 초기화함
						count++;
						return 0;
						//중복되는 교착상태를 발견한 경우
					}
				}
				if (arr[j][1] != first) {
					cnt++;
					arr2[cnt] = j;
					a = recursive(j,first);
					//return값에 따라 교착상태의 존재 여부를 판단함.
					if (a == 1) {
						print();
					}
					else if(a == 0) return 0;
				}
				else if (arr[j][1] == first) {
					cnt++;
					count++;
					arr2[cnt] = j;
					return 1;
					//교착상태를 찾았을 때
				}


			}
		}
		cnt--;
		return 2;
		//이전 값으로 돌아가서 탐색을 진행해야 하는경우
	}
}
